/*************************************************************************
* Problem:																 *
*			구간(Interval)과 숫자의 포함관계                                        *
*																		 *
*************************************************************************/
/*************************************************************************
*																		 *
*		국민대학교 소프트웨어융합대학 소프트웨어학부 2 학 년			 *
*														20181570  강주희 *
*																		 *
*************************************************************************/
#include <iostream>
using namespace std;

int testInclusion(int,int, int);

int main(void) {
	int t, a, b, m;

	cin >> t;
	for (int i = 0; i < t; i++) {
		cin >> a >> b >> m;
		cout << testInclusion(a, b, m) << endl;
	}
	return 0;
}

int testInclusion(int a, int b, int m) {
	return  a <= m && m <= b ? 1 : 0;
}