
/*************************************************************************
* Problem:																 *
*			윤년 구하기                                                  *
*																		 *
*																		 *
*************************************************************************/

/*************************************************************************
*																		 *
*		국민대학교 소프트웨어융합대학 소프트웨어학부 2 학 년			 *
*														20181570  강주희 *
*																		 *
*************************************************************************/

#include <iostream>
using namespace std;
int isLeapYear(int year);
int main(void)
{
	int t;
	int year;
	cin >> t;
	for (int i = 0; i < t; i++)
	{
		cin >> year;
		cout << isLeapYear(year) << endl;
	}
	return 0;
}
int isLeapYear(int year)
{
	if (year % 400 == 0 || (year % 100 != 0 && year % 4 == 0))
		return 1;
	else
		return 0;
}