/*************************************************************************
* Problem:																 *
*			숫자로 삼각형 출력하기                                       *
*																		 *
*************************************************************************/
/*************************************************************************
*																		 *
*		국민대학교 소프트웨어융합대학 소프트웨어학부 2 학 년			 *
*														20181570  강주희 *
*																		 *
*************************************************************************/
#include <iostream>

using namespace std;
void Pyramid(int n);

int main() {
	int t, n;
	cin >> t;
	for (int i = 0; i < t; ++i) {
		cin >> n;
		Pyramid(n);
	}
	return 0;
}

void Pyramid(int n) {
	for (int i = 1; i <= n; i++) {
		int sum = i;
		cout << i << " ";
		for (int j = i, cnt = 1; cnt < i; j++, cnt++) {
			cout << sum + (n - cnt) << " ";
			sum += (n - cnt);
		}
		cout << endl;
	}
}