/*************************************************************************
* Problem:																 *
*			숫자로 삼각형 출력하기                                       *
*																		 *
*************************************************************************/
/*************************************************************************
*																		 *
*		국민대학교 소프트웨어융합대학 소프트웨어학부 2 학 년			 *
*														20181570  강주희 *
*																		 *
*************************************************************************/
#include <iostream>

using namespace std;
void sandGlass(int);

int main() {
	int t, n;
	for (int i = 0; i < t; i++) {
		cin >> n;
		sandGlass(n);
	}
}

void sandGlass(int n) {
	
	int i;
	for (i = 0; i < (float)(n / 2); i++) {
	}

}